{"_id":"note:OM8sCLovL","title":"InformationArchitecture","content":"# Information Architecture\n* Web apps have exponentially more info available at any time than any given user need at any moment in time\n* IA is the practice of taking the information a business must make available to fulfill the needs of all users and organizing it so each user can easily meet their specific requirement at a moment in time\n\n### Who does it?\nUX Designer mainly. There are many stakeholders in IA. IA is important to development of an SEO strategy. It's relevant to marketing / content team, sales & customer service teams (although they are less likely to drive it)\n\n### Four systems of IA (much like the principles of library science)\n\n#### 1. Organizational Systems - How we group it\n  - humans can only process 7 pieces of info at a time\n  The progression of an organizational system coincides with the progression of the business \n  * Sequential System - info is presented linearly (step by step) ex. Onboarding flow\n  * Hierarchal - Tree like system (site maps, show how navigation is structured, where content sits, relationship between pages, tangible IA deliverable)\n  * Matrix - ex. Netflix interface, behind the scenes metadata. \n\n#### 2. Labeling Systems - What should we call it\n  - never simple, requires lots of user research. Must be consistent labelso\n\n> Organization & Labeling Systems make up the content hierarchy and taxonomy\n\n#### 3. Navigation Systems - How do users move through it\n  - (don't think of a nav bar / menu, but more of a user flow)\n  - To ensure easy navigation, make noticeable links on a page, remove clutter so users can see the next step, use correct labels, and use sidebars, breadcrumbs, and menus to help users move forward, backward, and out of predicted user flows.\n\n#### 4. Search Systems - How do users search it?\n- Effective search functions requires good metadata. \n\n### 4 Fundamental questions users always ask:\n1. *Am I in the right place?*\n2. *Does it have what I want?*\n3. *What else does it have?*\n4. *What do I do now?*\n\nNavigation & Search are a result of the users interacting with the content","tags":[],"folderPathname":"/","data":{},"createdAt":"2020-12-08T19:23:33.792Z","updatedAt":"2020-12-08T19:33:36.218Z","trashed":false,"_rev":"kA2uL8Zd5"}